<?php

// Пользователь вводит 6-ти значное число. Программа должна разбить число                  
// на разряды, и вывести в отдельной строке каждый разряд. Пример 
// ввод:  337456 
// Вывод: 
// 6 
// 5 
// 4 
// 7 
// 3 
// 3  
// Если задачу 3 вы решали с применением методов из типа String -                          
// попробуйте решить ее математическим путем. Если решали математическим                
// путем, попробуйте решить с использованием методов типа данных String.               