<?php

// * ​Написать программу которая считывает длинную строку с клавиатуры,                  
// выделяет из нее все цифры, находит их сумму и выводит на экран. Важно -                            
// цифры могут быть многозначные, отрицательные и с дробной частью.                  
// Использовать регулярные выражения или др. методы поиска по шаблону                  
// нельзя. ​Для решения вам понадобиться Google ).
// ​
//  Пример: 
// Ввод: 
// sdaf-1-2kjhg2dfcvjn33hvdr3.45mhgsd5hfc2----2 
// Вывод: 
// 40.45 

