<?php

// Пользователь вводит с клавиатуры последовательность из n чисел. Значение                  
// n вводится с клавиатуры. Числа записываются в массив размером n.                    
// Пользователь вводит с клавиатуры вторую последовательность из m чисел.                  
// Значение m вводится с клавиатуры. Числа записываются во второй массив                    
// размером m. Программа создает 3-й массив, копирует в него                  
// последовательно значения из первых двух массивов и вводит пользователю. 