<?php

// Пользователь вводит с клавиатуры последовательность из n чисел. Значение                  
// n вводится с клавиатуры. Вывести пользователю модифицированную              
// последовательность в которой: каждый элемент начиная со второго умножен                  
// на 2 если предшествующий элемент меньше 100 но больше 20, и                      
// дополнительно умножен на 3 если текущий минимум в раза раза больше                      
// предшествующего. Изменения вносимые во время процесса модификации, НЕ                
// должны учитываться в самом процессе! 