<?php

// Пользователь вводит с клавиатуры последовательность из n чисел. Значение                  
// n вводится с клавиатуры. Числа записываются в массив размером n.                    
// Программа создает 2 массива (один для всех четных, второй для нечетных) с                        
// НУЖНЫМ размером и копирует туда четные / нечетные соответственно. Если                    
// пользователь ввел ВСЕ четные или ВСЕ нечетные числа, программа не                    
// должна создавать новых массивов а вывести те числа, что ввел пользователь                      
// с указанием четности. 