<?php

// ** Реализовать бесконечно растущий массив. Программа работает              
// БЕСКОНЕЧНО (завершить ее можно нажав в эклипсе красный квадрат).                  
// Пользователь вводит число, программа добавляет его в массив и выводит все                      
// до этого введенные числа в одну строку через ‘,’ . Подсказка: Программа                        
// должна постоянно создавать новый массив большего размера, копируя в него                    
// уже введенные значения из предыдущего массива. 