<?php

// Написать программу, для проверки пользователя на знание таблицы                
// умножения. Пользователь вводит два целых одноразрядных числа A и B. Если                      
// числа не подходят по условию, программа просит ввести хи повторно. После                      
// успешного ввода, программа задает вопрос “A * B = ?”. Пользователь                      
// должен ввести ответ. Программа проверяет ответ. После завершения                
// проверки, программа предлагает пользователю повторить еще один пример                
// или завершить, для этого пользователь должен ввести 1 (для продолжения)                    
// или 0 (для выхода).  

// Решать не стал, просто и много писанины)