<?php

// Пользователь вводит с клавиатуры последовательность из n чисел. Значение                  
// n вводится с клавиатуры. Вывести на экран элементы последовательности                  
// которые удовлетворяют ВСЕМ условиям: 1) после них элементы которые                  
// делятся нацело 5 или текущий элемент последний; 2) перед ними элемент                      
// который меньше 100 или текущий элемент первый; 3) элемент находится во                      
// второй ПОЛОВИНЕ последовательности или в первых 3-х позициях   

// условие как по мне запутанное) пошел лучше решать задачки со звездочкой