<?php

// ** Написать полноценную консольную программу калькулятора,            
// поддерживающую следующие мат. действия: + - * / %. Программа должна                      
// предоставлять хороший диалог с пользователем. Принцип работы              
// калькулятора: 
// a) пользователь вводит число 
// b) пользователь вводит знак действия 
// c) пользователь опять вводит число 
// d) действие подсчитывается и выводится результат 
// e) дальше пользователь может сразу ввести знак, что будет значить что                    
// нужно делать действие с предыдущим результатом вместо первого                
// аргумента, или число, что будет значить, что результат сбрасывается и                    
// программа выполняется опять с пункта а) 
// f) пользователь в любой момент может написать слово off, что приведет                    
// к немедленному завершению программы 
// g) пользователь может в любой момент написать слово CE что приведет                    
// программу к пункту а) 